# Min

## Description
Returns the minimum of the two numbers.

```pascal
FUNCTION Min(
				val1 : REAL;
				val2 : REAL) : REAL;
```

```python

def vs.Min(val1, val2):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|val1|REAL||
|val2|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Math - General